adafruit/Adafruit_nRF52_Arduino/libraries/Bluefruit52Lib/src/bluefruit.cpp
      case BLE_GAP_EVT_CONN_PARAM_UPDATE:
      {
        // Connection Parameter after negotiating with Central
        // min conn = max conn = actual used interval
        ble_gap_conn_params_t* param = &evt->evt.gap_evt.params.conn_param_update.conn_params;
        _conn_interval = param->min_conn_interval;
      }
      break;

      case BLE_GAP_EVT_DISCONNECTED:
        if (_disconnect_cb) ada_callback(NULL, _disconnect_cb, _conn_hdl, evt->evt.gap_evt.params.disconnected.reason);

        LOG_LV2("GAP", "Disconnect Reason 0x%02X", evt->evt.gap_evt.params.disconnected.reason);

        _conn_hdl = BLE_CONN_HANDLE_INVALID;
      break;

      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        sd_ble_gatts_sys_attr_set(_conn_hdl, NULL, 0, 0);
      break;

      default: break;
    }
  }

  // Central Event Handler
  if (_central_count)
  {
    // Skip if not central connection
    if (evt_conn_hdl != _conn_hdl ||
        evt_conn_hdl == BLE_CONN_HANDLE_INVALID)
    {
      Central._event_handler(evt);
    }
  }

  // Discovery Event Handler
  if ( Discovery.begun() ) Discovery._event_handler(evt);

  // GATTs characteristics event handler
  Gatt._eventHandler(evt);

  // User callback if set
  if (_event_cb) _event_cb(evt);
}

/*------------------------------------------------------------------*/
/* Internal Connection LED
 *------------------------------------------------------------------*/
void AdafruitBluefruit::_startConnLed(void)
{
  if (_led_conn) xTimerStart(_led_blink_th, 0);
}

void AdafruitBluefruit::_stopConnLed(void)
{
  xTimerStop(_led_blink_th, 0);
}

void AdafruitBluefruit::_setConnLed (bool on_off)
{
  if (_led_conn)
  {
    digitalWrite(LED_BLUE, on_off ? LED_STATE_ON : (1-LED_STATE_ON) );
  }
}

/*------------------------------------------------------------------*/
/* Bonds
 *------------------------------------------------------------------*/
bool AdafruitBluefruit::requestPairing(void)
{
  return Gap.requestPairing(_conn_hdl);
}

void AdafruitBluefruit::clearBonds(void)
{
  bond_clear_prph();
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+

void Bluefruit_printInfo(void)
{
  Bluefruit.printInfo();
}

void AdafruitBluefruit::printInfo(void)
{
  // Skip if Serial is not initialised
  if ( !Serial ) return;

  // Skip if Bluefruit.begin() is not called
  if ( _ble_event_sem == NULL ) return;

  Serial.println("--------- SoftDevice Config ---------");

  char const * title_fmt = "%-16s: ";

  /*------------- SoftDevice Config -------------*/
  // Max uuid128
  Serial.printf(title_fmt, "Max UUID128");
  Serial.println(_sd_cfg.uuid128_max);

  // ATTR Table Size
  Serial.printf(title_fmt, "ATTR Table Size");
  Serial.println(_sd_cfg.attr_table_size);

  // Service Changed
  Serial.printf(title_fmt, "Service Changed");
  Serial.println(_sd_cfg.service_changed);

  if ( _prph_count )
  {
    Serial.println("Peripheral Connect Setting");

    Serial.print("  - ");
    Serial.printf(title_fmt, "Max MTU");
    Serial.println(Gap._cfg_prph.mtu_max);

    Serial.print("  - ");
    Serial.printf(title_fmt, "Event Length");
    Serial.println(Gap._cfg_prph.event_len);

    Serial.print("  - ");
    Serial.printf(title_fmt, "HVN Queue Size");
    Serial.println(Gap._cfg_prph.hvn_tx_qsize);

    Serial.print("  - ");
    Serial.printf(title_fmt, "WrCmd Queue Size");
    Serial.println(Gap._cfg_prph.wr_cmd_qsize);
  }

  if ( _central_count )
  {
    Serial.println("Central Connect Setting");

    Serial.print("  - ");
    Serial.printf(title_fmt, "Max MTU");
    Serial.println(Gap._cfg_central.mtu_max);

    Serial.print("  - ");
    Serial.printf(title_fmt, "Event Length");
    Serial.println(Gap._cfg_central.event_len);

    Serial.print("  - ");
    Serial.printf(title_fmt, "HVN Queue Size");
    Serial.println(Gap._cfg_central.hvn_tx_qsize);

    Serial.print("  - ");
    Serial.printf(title_fmt, "WrCmd Queue Size");
    Serial.println(Gap._cfg_central.wr_cmd_qsize);
  }

  /*------------- Settings -------------*/
  Serial.println("\n--------- BLE Settings ---------");
  // Name
  Serial.printf(title_fmt, "Name");
  {
    char name[32];
    memclr(name, sizeof(name));
    getName(name, sizeof(name));
    Serial.printf(name);
  }
  Serial.println();

  // Max Connections
  Serial.printf(title_fmt, "Max Connections");
  Serial.printf("Peripheral = %d, ", _prph_count ? 1 : 0);
  Serial.printf("Central = %d ", _central_count ? BLE_CENTRAL_MAX_CONN : 0);
  Serial.println();

  // Address
  Serial.printf(title_fmt, "Address");
  {
    char const * type_str[] = { "Public", "Static", "Private Resolvable", "Private Non Resolvable" };
    uint8_t mac[6];
    uint8_t type = Gap.getAddr(mac);

    // MAC is in little endian --> print reverse
    Serial.printBufferReverse(mac, 6, ':');
    Serial.printf(" (%s)", type_str[type]);
  }
  Serial.println();

  // Tx Power
  Serial.printf(title_fmt, "TX Power");
  Serial.printf("%d dBm", _tx_power);
  Serial.println();

  // Connection Intervals
  Serial.printf(title_fmt, "Conn Intervals");
  Serial.printf("min = %.2f ms, ", _ppcp.min_conn_interval*1.25f);
  Serial.printf("max = %.2f ms", _ppcp.max_conn_interval*1.25f);
  Serial.println();

  Serial.printf(title_fmt, "Conn Timeout");
  Serial.printf("%.2f ms", _ppcp.conn_sup_timeout*10.0f);
  Serial.println();

  /*------------- List the paried device -------------*/
  if ( _prph_count )
  {
    Serial.printf(title_fmt, "Peripheral Paired Devices");
    Serial.println();
    bond_print_list(BLE_GAP_ROLE_PERIPH);
  }

  if ( _central_count )
  {
    Serial.printf(title_fmt, "Central Paired Devices");
    Serial.println();
    bond_print_list(BLE_GAP_ROLE_CENTRAL);
  }

  Serial.println();
}
